# Табель успеваемости. Пользователь в

# бесконечном цикле (пока не будет введена пустая строка)
# вводит строки вида: 'название предмета'
# 'фамилия ученика' 'оценка'.
# После окончания ввода программа
# выводит в консоль Название предмета,
# далее список учеников и все их
# оценки в виде таблицы
#
# Математика Иванов 5
# Математика Иванов 4
# Литература Иванов 3
# Математика Петров 5
# Литература Сидоров 3
# Литература Петров 5
# Литература Иванов 4
# Математика Сидоров 3
# Математика Петров 5
#  
# Математика
# Иванов 5 4
# Петров 5 5
# Сидоров 3
#
# Литература
# Ивванов 3 4
# Сидоров 3
# Петров 5

# my_list = [
#     'Математика Иванов 5',
#     'Математика Петров 4',
#     'Литература Иванов 3',
#     'Литература Петров 3',
#     'Литература Сидоров 5',
#     'Математика Иванов 3',
#     'Литература Петров 5',
#     'Литература Иванов 5',
#     'Математика Иванов 2',
#     'Математика Петров 3',
#     'Математика Сидоров 5',
#     'Математика Иванов 4',
#     'Математика Сидоров 4',
#     'Математика Петров 1'
# ]
my_list = []
while True:
    string = input('Введите запись(либо Enter для выхода): ')
    if string == '':
        break
    my_list.append(string)
my_dict = {}
for record in my_list:
    split_record = record.split()
    subject = split_record[0]
    name = split_record[1]
    sign = split_record[2]

    if not my_dict.get(subject):
        my_dict[subject] = {name: sign}
    else:
        if not my_dict[subject].get(name):
            my_dict[subject][name] = sign
        else:
            my_dict[subject][name] = my_dict[subject][name] + " " + sign

for subject in my_dict.keys():
    print()
    print(subject)
    for name in my_dict[subject].keys():
        print(f'{name} {my_dict[subject][name]}')
